# Label Utils Get Structural Section Shape Name Method

Source: https://www.revitapidocs.com/2026/4969a1cc-9943-c418-dfca-9672b0fba75f.htm

---

| Label Utils Get Structural Section Shape Name Method |
| --- |

Gets the user\-visible name for a StructuralSectionShape.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static string GetStructuralSectionShapeName(
	StructuralSectionShape shape
)
```

```
Public Shared Function GetStructuralSectionShapeName (
	shape As StructuralSectionShape
) As String
```

```
public:
static String^ GetStructuralSectionShapeName(
	StructuralSectionShape shape
)
```

```
static member GetStructuralSectionShapeName :
        shape : StructuralSectionShape -> string
```

#### Parameters

shape StructuralSectionShape
:   The StructuralSectionShape to get the user\-visible name.

#### Return Value

String
Returns the user\-visible name for the StructuralSectionShape. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

Remarks The name is obtained in the current Revit language. See Also

#### Reference

LabelUtils Class Autodesk.Revit.DB Namespace